Revit 2027 API
PathOfTravel.LineStyle Property
 The line style of the path.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LineStyle { get; set; }
Public Property LineStyle As ElementId
	Get
	Set
public:
property ElementId^ LineStyle {
	ElementId^ get ();
	void set (ElementId^ value);
}
member LineStyle : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace